1.  Получаем список всех людей с их профессией и номером телефона, если человек не является работником отеля, то его данные не известны
# 2022-12-13 10:18:52.858479
select p.`FullName` as 'full name', e.`Speciality` as 'speciality',
e.`PhoneNumber` as 'phone' from `PersonInfo` p left join `Employee` e
on e.employee_id = p.person_id
+----------------------+-------------------------------+-------------+
| full name            | speciality                    | phone       |
+----------------------+-------------------------------+-------------+
| Джозеф Бранде        | <null>                        | <null>      |
| Миса Куджо           | <null>                        | <null>      |
| Джотаро Бранде       | <null>                        | <null>      |
| Шигео Лайт           | <null>                        | <null>      |
| Джолин Геноза        | Администратор                 | +7633905998 |
| Кира Бранде          | Спеиалист по связям с гостями | +8775128141 |
| Мива Ленгли          | <null>                        | <null>      |
| Мива Агацума         | <null>                        | <null>      |
| Константин Токийский | Шеф-повар                     | +8561820879 |
| Джотаро Икари        | <null>                        | <null>      |
| Макима Мухаммед      | Менеджер по туризму           | +6370092385 |
| Даниил Почитта       | <null>                        | <null>      |
| Миса Ленгли          | Медик                         | +6696620131 |
| Джозеф Почитта       | Охранник                      | +6576731363 |
| Фэй Мышь             | Официант                      | +7032400625 |
| Джотаро Мышь         | Горничная                     | +6339669045 |
| Сайтама Аканэ        | <null>                        | <null>      |
| Мива Мышь            | Директор                      | +7319557424 |
| Синдзи Лайт          | <null>                        | <null>      |
| Джонатан Агацума     | <null>                        | <null>      |
| Роуз Джостар         | Массажист                     | +8586938954 |
| Роуз Куджо           | <null>                        | <null>      |
| Джозеф Геноза        | Техник                        | +7975577625 |
| Макима Икари         | <null>                        | <null>      |
| Илья Аянами          | PR-менеджер                   | +7519542970 |
| Илья Ленгли          | <null>                        | <null>      |
| Даниил Агацума       | Повар                         | +6012589973 |
| Джорно Икари         | Портье                        | +7916272431 |
| Синдзи Токийский     | <null>                        | <null>      |
| Джотаро Лайт         | <null>                        | <null>      |
| Джорно Фубуки        | Консьерж                      | +8115965305 |
| Миса Мышь            | <null>                        | <null>      |
| Фэй Лайт             | Повар                         | +6522494619 |
| Рей Икари            | <null>                        | <null>      |
| Макима Узумаки       | Бармен                        | +6703620071 |
| Сасаки Мышь          | <null>                        | <null>      |
| Кира Амане           | Швейцар                       | +7612707801 |
| Миса Аканэ           | Гид-экскурсовод               | +8358533387 |
| Джорно Ленгли        | Менеджер                      | +8738864690 |
| Рей Аянами           | <null>                        | <null>      |
+----------------------+-------------------------------+-------------+
40 rows in set
Time: 0.031s

2. получаем таблицу с парами id: руководитель - подчинённый
# 2022-12-13 10:29:26.982138
select sps.supervisor_id, spe.employee_id from
( select distinct supervisor_id from `EmployeeDetailedInfo` ) sps right join
`EmployeeDetailedInfo` spe on spe.supervisor_id = sps.supervisor_id;
+---------------+-------------+
| supervisor_id | employee_id |
+---------------+-------------+
| <null>        | 5           |
| 5             | 9           |
| 5             | 13          |
| 5             | 14          |
| 5             | 15          |
| 5             | 16          |
| 5             | 18          |
| 5             | 21          |
| 5             | 23          |
| 5             | 28          |
| 5             | 31          |
| 5             | 35          |
| 5             | 37          |
| 5             | 38          |
| 5             | 39          |
| 9             | 27          |
| 9             | 33          |
| 39            | 6           |
| 39            | 11          |
| 39            | 25          |
+---------------+-------------+
20 rows in set
Time: 0.013s

3. получаем таблицу с парами полных имён: руководитель - подчинённый
# 2022-12-13 10:35:22.902680
select p1.FullName, p2.FullName from (
    PersonInfo p1 inner join(
        (  select distinct supervisor_id from `EmployeeDetailedInfo` ) sps
        right join `EmployeeDetailedInfo` spe
        on spe.supervisor_id = sps.supervisor_id )
    on p1.person_id = sps.supervisor_id
)
inner join PersonInfo p2 on p2.person_id = spe.employee_id
order by p1.FullName, p2.FullName;
+----------------------+----------------------+
| FullName             | FullName             |
+----------------------+----------------------+
| Джолин Геноза        | Джозеф Геноза        |
| Джолин Геноза        | Джозеф Почитта       |
| Джолин Геноза        | Джорно Икари         |
| Джолин Геноза        | Джорно Ленгли        |
| Джолин Геноза        | Джорно Фубуки        |
| Джолин Геноза        | Джотаро Мышь         |
| Джолин Геноза        | Кира Амане           |
| Джолин Геноза        | Константин Токийский |
| Джолин Геноза        | Макима Узумаки       |
| Джолин Геноза        | Мива Мышь            |
| Джолин Геноза        | Миса Аканэ           |
| Джолин Геноза        | Миса Ленгли          |
| Джолин Геноза        | Роуз Джостар         |
| Джолин Геноза        | Фэй Мышь             |
| Джорно Ленгли        | Илья Аянами          |
| Джорно Ленгли        | Кира Бранде          |
| Джорно Ленгли        | Макима Мухаммед      |
| Константин Токийский | Даниил Агацума       |
| Константин Токийский | Фэй Лайт             |
+----------------------+----------------------+
19 rows in set
Time: 0.031s

4. получаем таблицу с парами полных имён: руководитель - подчинённый, включая тех, у кого нет руководителя

# 2022-12-13 10:38:06.142373
select p1.FullName, p2.FullName from (
    PersonInfo p1 right join(
        (  select distinct supervisor_id from `EmployeeDetailedInfo` ) sps
        right join `EmployeeDetailedInfo` spe
        on spe.supervisor_id = sps.supervisor_id )
    on p1.person_id = sps.supervisor_id
)
left join PersonInfo p2 on p2.person_id = spe.employee_id
order by p1.FullName, p2.FullName;
+----------------------+----------------------+
| FullName             | FullName             |
+----------------------+----------------------+
| <null>               | Джолин Геноза        |
| Джолин Геноза        | Джозеф Геноза        |
| Джолин Геноза        | Джозеф Почитта       |
| Джолин Геноза        | Джорно Икари         |
| Джолин Геноза        | Джорно Ленгли        |
| Джолин Геноза        | Джорно Фубуки        |
| Джолин Геноза        | Джотаро Мышь         |
| Джолин Геноза        | Кира Амане           |
| Джолин Геноза        | Константин Токийский |
| Джолин Геноза        | Макима Узумаки       |
| Джолин Геноза        | Мива Мышь            |
| Джолин Геноза        | Миса Аканэ           |
| Джолин Геноза        | Миса Ленгли          |
| Джолин Геноза        | Роуз Джостар         |
| Джолин Геноза        | Фэй Мышь             |
| Джорно Ленгли        | Илья Аянами          |
| Джорно Ленгли        | Кира Бранде          |
| Джорно Ленгли        | Макима Мухаммед      |
| Константин Токийский | Даниил Агацума       |
| Константин Токийский | Фэй Лайт             |
+----------------------+----------------------+
20 rows in set
Time: 0.016s

# 2022-12-13 10:38:29.341404
exit;
Goodbye!
